Repository: baselabbasi/Hr_Managment_System
Catalog: HrMangmentSystem_Shared/Resources/SharedResource.*.resx
Languages: ar

# Department_HasChildren
source: Cannot delete department because it has child departments.
ar: لا يمكن حذف القسم لوجود أقسام فرعية مرتبطة به.

# Department_HasEmployees
source: Cannot delete department because employees are assigned to it.
ar: لا يمكن حذف القسم لارتباط موظفين به.

# Department_CannotBeOwnParent
source: Department cannot be parent of itself.
ar: لا يمكن أن يكون القسم أبًا لنفسه.

# Department_CodeExists
source: Department code is already in use.
ar: كود القسم مستخدم من قبل.

# Department_CodeRequired
source: DeptName and Code are required.
ar: يجب إدخال اسم القسم والكود.

# Department_Created
source: Department created successfully.
ar: تم إنشاء القسم بنجاح.

# Department_Deleted
source: Department deleted successfully.
ar: تم حذف القسم بنجاح.

# Department_ManagerAssigned
source: Cannot delete department because it has a manager assigned.
ar: لا يمكن حذف القسم لوجود مدير مرتبط به.

source: Department not found.
ar: لم يتم العثور على القسم.

# Department_ParentNotFound
source: Parent department not found.
ar: لم يتم العثور على القسم الأب.

# Department_Updated
source: Department updated successfully.
ar: تم تحديث القسم بنجاح.

# Generic_IdMismatch
source: ID mismatch.
ar: رقم المعرف (ID) غير متطابق.

# Generic_InvalidData
source: Invalid request data.
ar: البيانات المرسلة غير صحيحة.

# Generic_NotFound
source: Resource not found.
ar: لم يتم العثور على البيانات.

# Generic_OperationFailed
source: Operation failed.
ar: فشلت العملية.

# Generic_OperationSucceeded
source: Operation completed successfully.
ar: تمت العملية بنجاح.

# Generic_UnexpectedError
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Employee not found.
ar: لم يتم العثور على الموظف.

# Employee_Created
source: Employee created successfully.
ar: تم إنشاء الموظف بنجاح.

# Employee_Updated
source: Employee updated successfully.
ar: تم تحديث بيانات الموظف بنجاح.

# Employee_Deleted
source: Employee deleted successfully.
ar: تم حذف الموظف بنجاح.

# Employee_EmailExists
source: Employee with this email already exists.
ar: يوجد موظف آخر بنفس البريد الإلكتروني.

# Employee_BasicFieldsRequired
source: First name, last name and email are required.
ar: الاسم الأول، اسم العائلة والبريد الإلكتروني مطلوبة.

# Employee_InvalidDateOfBirth
source: Invalid date of birth.
ar: تاريخ الميلاد غير صالح.

# Employee_InvalidEmploymentDate
source: Invalid employment start date.
ar: تاريخ بدء العمل غير صالح.

# Employee_MustBeAdult
source: Employee must be at least 18 years old.
ar: يجب أن يكون عمر الموظف 18 سنة على الأقل.

# Employee_PositionRequired
source: Position is required.
ar: المسمى الوظيفي مطلوب.

# Employee_DepartmentNotFound
source: Department for this employee was not found.
ar: لم يتم العثور على القسم الخاص بهذا الموظف.

# Employee_HasSubordinates
source: Cannot delete employee because they have subordinates.
ar: لا يمكن حذف الموظف لوجود موظفين تابعين له.

# Employee_IsDepartmentManager
source: Cannot delete employee because they are assigned as manager.
ar: لا يمكن حذف الموظف لأنه معيّن كمدير لأحد الأقسام.

# Delete_DeletedByRequired
source: DeletedByEmployeeId is required.
ar: معرّف الموظف الذي قام بالحذف مطلوب.

# Delete_Forbidden
source: You cannot delete this resource.
ar: لا يمكنك حذف هذا السجل.

# Employee_ListLoaded
source: Employees loaded successfully.
ar: تم تحميل قائمة الموظفين بنجاح.

# Department_ListLoaded
source: Departments loaded successfully.
ar: تم تحميل قائمة الأقسام بنجاح.

# Pagination_InvalidPageNumber
source: Invalid page number.
ar: رقم الصفحة غير صالح.

# Pagination_InvalidPageSize
source: Invalid page size.
ar: حجم الصفحة غير صالح.

# Auth_LoginSuccess
source: Login successful.
ar: تم تسجيل الدخول بنجاح.

# Auth_Unauthorized
source: You are not authorized.
ar: غير مصرح لك بتنفيذ هذه العملية.

# EmployeeRole_AlreadyAssigned
source: Employee is already has role
ar: الموظف لديه دور/ مسؤولية بالأصل

# EmployeeRole_Assigned
source: Employee role defualt assigned to employee
ar: تم اسناد الدور/المسؤولية الى الموظف المعني

# Auth_InvalidCredentials
source: Invalid email or password.
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة.
